***
# chapter 4.  JOIN 
***

## 4-1  EQUI JOIN (INNER JOIN, SIMPLE JOIN)
키값이 일치되는 데이터만 출력 (NULL은 출력되지 않는다)

In [1]:
import cx_Oracle
import pandas as pd
xedb = cx_Oracle.connect('hr/hr@localhost/xe')
cur = xedb.cursor()

### < employees테이블, departments테이블 연결하기 >

In [3]:
df = pd.read_sql("""
        SELECT e.employee_id, e.last_name, d.department_id, d.department_name
        FROM employees e, departments d
        WHERE e.department_id = d.department_id
        """,xedb)
print(df)

     EMPLOYEE_ID    LAST_NAME  DEPARTMENT_ID  DEPARTMENT_NAME
0            200       Whalen             10   Administration
1            201    Hartstein             20        Marketing
2            202          Fay             20        Marketing
3            114     Raphaely             30       Purchasing
4            115         Khoo             30       Purchasing
5            116        Baida             30       Purchasing
6            117       Tobias             30       Purchasing
7            118       Himuro             30       Purchasing
8            119   Colmenares             30       Purchasing
9            203       Mavris             40  Human Resources
10           120        Weiss             50         Shipping
11           121        Fripp             50         Shipping
12           122     Kaufling             50         Shipping
13           123      Vollman             50         Shipping
14           124      Mourgos             50         Shipping
15           125        Nayer             50         Shipping
16           126  Mikkilineni             50         Shipping
17           127       Landry             50         Shipping
18           128       Markle             50         Shipping
19           129       Bissot             50         Shipping
20           130     Atkinson             50         Shipping
21           131       Marlow             50         Shipping
22           132        Olson             50         Shipping
23           133       Mallin             50         Shipping
24           134       Rogers             50         Shipping
25           135          Gee             50         Shipping
26           136   Philtanker             50         Shipping
27           137       Ladwig             50         Shipping
28           138       Stiles             50         Shipping
29           139          Seo             50         Shipping
..           ...          ...            ...              ...
76           160        Doran             80            Sales
77           161       Sewall             80            Sales
78           162      Vishney             80            Sales
79           163       Greene             80            Sales
80           164      Marvins             80            Sales
81           165          Lee             80            Sales
82           166         Ande             80            Sales
83           167        Banda             80            Sales
84           168         Ozer             80            Sales
85           169        Bloom             80            Sales
86           170          Fox             80            Sales
87           171        Smith             80            Sales
88           172        Bates             80            Sales
89           173        Kumar             80            Sales
90           174         Abel             80            Sales
91           175       Hutton             80            Sales
92           176       Taylor             80            Sales
93           177   Livingston             80            Sales
94           179      Johnson             80            Sales
95           100         King             90        Executive
96           101      Kochhar             90        Executive
97           102      De Haan             90        Executive
98           108    Greenberg            100          Finance
99           109       Faviet            100          Finance
100          110         Chen            100          Finance
101          111      Sciarra            100          Finance
102          112        Urman            100          Finance
103          113         Popp            100          Finance
104          205      Higgins            110       Accounting
105          206        Gietz            110       Accounting

[106 rows x 4 columns]

### < 연결된 두 개의 테이블(employees, departments)에 테이블(locations) 추가하기 >

In [4]:
df = pd.read_sql("""
        SELECT e.employee_id, e.last_name, d.department_id, d.department_name, l.city
        FROM employees e, departments d, locations l
        WHERE e.department_id = d.department_id
        AND d.location_id = l.location_id
        """,xedb)
print(df)

     EMPLOYEE_ID    LAST_NAME  DEPARTMENT_ID   DEPARTMENT_NAME  \
0            100         King             90         Executive
1            101      Kochhar             90         Executive
2            102      De Haan             90         Executive
3            103       Hunold             60                IT
4            104        Ernst             60                IT
5            105       Austin             60                IT
6            106    Pataballa             60                IT
7            107      Lorentz             60                IT
8            108    Greenberg            100           Finance
9            109       Faviet            100           Finance
10           110         Chen            100           Finance
11           111      Sciarra            100           Finance
12           112        Urman            100           Finance
13           113         Popp            100           Finance
14           114     Raphaely             30        Purchasing
15           115         Khoo             30        Purchasing
16           116        Baida             30        Purchasing
17           117       Tobias             30        Purchasing
18           118       Himuro             30        Purchasing
19           119   Colmenares             30        Purchasing
20           120        Weiss             50          Shipping
21           121        Fripp             50          Shipping
22           122     Kaufling             50          Shipping
23           123      Vollman             50          Shipping
24           124      Mourgos             50          Shipping
25           125        Nayer             50          Shipping
26           126  Mikkilineni             50          Shipping
27           127       Landry             50          Shipping
28           128       Markle             50          Shipping
29           129       Bissot             50          Shipping
..           ...          ...            ...               ...
76           176       Taylor             80             Sales
77           177   Livingston             80             Sales
78           179      Johnson             80             Sales
79           180       Taylor             50          Shipping
80           181       Fleaur             50          Shipping
81           182     Sullivan             50          Shipping
82           183        Geoni             50          Shipping
83           184     Sarchand             50          Shipping
84           185         Bull             50          Shipping
85           186    Dellinger             50          Shipping
86           187       Cabrio             50          Shipping
87           188        Chung             50          Shipping
88           189        Dilly             50          Shipping
89           190        Gates             50          Shipping
90           191      Perkins             50          Shipping
91           192         Bell             50          Shipping
92           193      Everett             50          Shipping
93           194       McCain             50          Shipping
94           195        Jones             50          Shipping
95           196        Walsh             50          Shipping
96           197       Feeney             50          Shipping
97           198     OConnell             50          Shipping
98           199        Grant             50          Shipping
99           200       Whalen             10    Administration
100          201    Hartstein             20         Marketing
101          202          Fay             20         Marketing
102          203       Mavris             40   Human Resources
103          204         Baer             70  Public Relations
104          205      Higgins            110        Accounting
105          206        Gietz            110        Accounting

                    CITY
0                Seattle
1                Seattle
2                Seattle
3              Southlake
4              Southlake
5              Southlake
6              Southlake
7              Southlake
8                Seattle
9                Seattle
10               Seattle
11               Seattle
12               Seattle
13               Seattle
14               Seattle
15               Seattle
16               Seattle
17               Seattle
18               Seattle
19               Seattle
20   South San Francisco
21   South San Francisco
22   South San Francisco
23   South San Francisco
24   South San Francisco
25   South San Francisco
26   South San Francisco
27   South San Francisco
28   South San Francisco
29   South San Francisco
..                   ...
76                Oxford
77                Oxford
78                Oxford
79   South San Francisco
80   South San Francisco
81   South San Francisco
82   South San Francisco
83   South San Francisco
84   South San Francisco
85   South San Francisco
86   South San Francisco
87   South San Francisco
88   South San Francisco
89   South San Francisco
90   South San Francisco
91   South San Francisco
92   South San Francisco
93   South San Francisco
94   South San Francisco
95   South San Francisco
96   South San Francisco
97   South San Francisco
98   South San Francisco
99               Seattle
100              Toronto
101              Toronto
102               London
103               Munich
104              Seattle
105              Seattle

[106 rows x 5 columns]

조인에 있는 두 테이블의 열을 결합하는 where절(e.department_id = d.department_id )보다 
하나의 테이블만 참조하는 where절(e.employee_id=100)을 먼저 수행하는 것이 효율적이다.
(ROWID SCAN 유도)

In [8]:
df = pd.read_sql("""
        SELECT e.employee_id, e.last_name, d.department_name, l.city
        FROM employees e, departments d, locations l
        WHERE e.department_id = d.department_id 
        AND d.location_id = l.location_id   
        AND e.employee_id=100  
        """,xedb)
print(df)

   EMPLOYEE_ID LAST_NAME DEPARTMENT_NAME     CITY
0          100      King       Executive  Seattle

## 4-2. NON EQUI JOIN
* 테이블간 키 값이 정확하게 일치하지 않고,범주간 접근이 필요할 때 사용

In [10]:
# 새로운 테이블 생성 및 조회

cur.execute("CREATE TABLE job_grades(grade_level varchar2(3), lowest_sal number, highest_sal number)")
cur.execute("INSERT INTO job_grades VALUES ('A',1000,2999)")
cur.execute("INSERT INTO job_grades VALUES ('B',3000,5999)")
cur.execute("INSERT INTO job_grades VALUES ('C',6000,9999)")
cur.execute("INSERT INTO job_grades VALUES ('D',10000,14999)")
cur.execute("INSERT INTO job_grades VALUES ('E',15000,24999)")
cur.execute("INSERT INTO job_grades VALUES ('F',25000,40000)")

df = pd.read_sql("""
        SELECT * FROM job_grades
        """,xedb)
print(df)

  GRADE_LEVEL  LOWEST_SAL  HIGHEST_SAL
0           A        1000         2999
1           B        3000         5999
2           C        6000         9999
3           D       10000        14999
4           E       15000        24999
5           F       25000        40000

In [11]:
df = pd.read_sql("""
        SELECT e.last_name, e.job_id, e.salary, j.grade_level
        FROM employees e , job_grades j
        WHERE e.salary 
        BETWEEN j.lowest_sal 
        AND j.highest_sal
        """,xedb)
print(df)

       LAST_NAME      JOB_ID   SALARY GRADE_LEVEL
0          Olson    ST_CLERK   2100.0           A
1         Markle    ST_CLERK   2200.0           A
2     Philtanker    ST_CLERK   2200.0           A
3         Landry    ST_CLERK   2400.0           A
4            Gee    ST_CLERK   2400.0           A
5     Colmenares    PU_CLERK   2500.0           A
6         Marlow    ST_CLERK   2500.0           A
7          Patel    ST_CLERK   2500.0           A
8         Vargas    ST_CLERK   2500.0           A
9       Sullivan    SH_CLERK   2500.0           A
10       Perkins    SH_CLERK   2500.0           A
11        Himuro    PU_CLERK   2600.0           A
12         Matos    ST_CLERK   2600.0           A
13      OConnell    SH_CLERK   2600.0           A
14         Grant    SH_CLERK   2600.0           A
15   Mikkilineni    ST_CLERK   2700.0           A
16           Seo    ST_CLERK   2700.0           A
17        Tobias    PU_CLERK   2800.0           A
18      Atkinson    ST_CLERK   2800.0           A
19         Geoni    SH_CLERK   2800.0           A
20         Jones    SH_CLERK   2800.0           A
21         Baida    PU_CLERK   2900.0           A
22        Rogers    ST_CLERK   2900.0           A
23         Gates    SH_CLERK   2900.0           A
24        Cabrio    SH_CLERK   3000.0           B
25        Feeney    SH_CLERK   3000.0           B
26          Khoo    PU_CLERK   3100.0           B
27        Davies    ST_CLERK   3100.0           B
28        Fleaur    SH_CLERK   3100.0           B
29         Walsh    SH_CLERK   3100.0           B
..           ...         ...      ...         ...
77    Livingston      SA_REP   8400.0           C
78        Taylor      SA_REP   8600.0           C
79        Hutton      SA_REP   8800.0           C
80        Hunold     IT_PROG   9000.0           C
81        Faviet  FI_ACCOUNT   9000.0           C
82          Hall      SA_REP   9000.0           C
83        McEwen      SA_REP   9000.0           C
84         Sully      SA_REP   9500.0           C
85        Greene      SA_REP   9500.0           C
86     Bernstein      SA_REP   9500.0           C
87           Fox      SA_REP   9600.0           C
88          Baer      PR_REP  10000.0           D
89         Bloom      SA_REP  10000.0           D
90          King      SA_REP  10000.0           D
91        Tucker      SA_REP  10000.0           D
92       Vishney      SA_REP  10500.0           D
93       Zlotkey      SA_MAN  10500.0           D
94     Cambrault      SA_MAN  11000.0           D
95      Raphaely      PU_MAN  11000.0           D
96          Abel      SA_REP  11000.0           D
97          Ozer      SA_REP  11500.0           D
98     Errazuriz      SA_MAN  12000.0           D
99       Higgins      AC_MGR  12008.0           D
100    Greenberg      FI_MGR  12008.0           D
101    Hartstein      MK_MAN  13000.0           D
102     Partners      SA_MAN  13500.0           D
103      Russell      SA_MAN  14000.0           D
104      De Haan       AD_VP  17000.0           E
105      Kochhar       AD_VP  17000.0           E
106         King     AD_PRES  24000.0           E

[107 rows x 4 columns]

## 4-3 OUTER JOIN
* 키값이 일치된 데이터 (EQUI JOIN)외에도 누락된 데이터(NULL)도 출력
* 예 : employees테이블에 있는 null값을 뽑아내야 한다면 반대쪽 테이블인 departments테이블에 (+)를 넣는다

### < LEFT OUTER JOIN >
#### 전체 사원의 부서명을 파악하고, 부서배치를 받지 않은 사원까지 조회

In [12]:
df = pd.read_sql("""
        SELECT e.last_name, d.department_name
        FROM employees e, departments d
        WHERE e.department_id = d.department_id(+)
        """,xedb)
print(df)

      LAST_NAME  DEPARTMENT_NAME
0        Whalen   Administration
1           Fay        Marketing
2     Hartstein        Marketing
3    Colmenares       Purchasing
4        Himuro       Purchasing
5        Tobias       Purchasing
6         Baida       Purchasing
7          Khoo       Purchasing
8      Raphaely       Purchasing
9        Mavris  Human Resources
10        Grant         Shipping
11     OConnell         Shipping
12       Feeney         Shipping
13        Walsh         Shipping
14        Jones         Shipping
15       McCain         Shipping
16      Everett         Shipping
17         Bell         Shipping
18      Perkins         Shipping
19        Gates         Shipping
20        Dilly         Shipping
21        Chung         Shipping
22       Cabrio         Shipping
23    Dellinger         Shipping
24         Bull         Shipping
25     Sarchand         Shipping
26        Geoni         Shipping
27     Sullivan         Shipping
28       Fleaur         Shipping
29       Taylor         Shipping
..          ...              ...
77      Vishney            Sales
78       Sewall            Sales
79        Doran            Sales
80        Smith            Sales
81       McEwen            Sales
82        Sully            Sales
83         King            Sales
84      Tuvault            Sales
85    Cambrault            Sales
86        Olsen            Sales
87         Hall            Sales
88    Bernstein            Sales
89       Tucker            Sales
90      Zlotkey            Sales
91    Cambrault            Sales
92    Errazuriz            Sales
93     Partners            Sales
94      Russell            Sales
95      De Haan        Executive
96      Kochhar        Executive
97         King        Executive
98         Popp          Finance
99        Urman          Finance
100     Sciarra          Finance
101        Chen          Finance
102      Faviet          Finance
103   Greenberg          Finance
104       Gietz       Accounting
105     Higgins       Accounting
106       Grant             None

[107 rows x 2 columns]

In [13]:
df = pd.read_sql("""
        SELECT e.last_name, e.department_id, d.department_name
        FROM employees e 
        LEFT OUTER JOIN departments d
        ON (e.department_id = d.department_id)
        """,xedb)
print(df)

      LAST_NAME  DEPARTMENT_ID  DEPARTMENT_NAME
0        Whalen           10.0   Administration
1           Fay           20.0        Marketing
2     Hartstein           20.0        Marketing
3    Colmenares           30.0       Purchasing
4        Himuro           30.0       Purchasing
5        Tobias           30.0       Purchasing
6         Baida           30.0       Purchasing
7          Khoo           30.0       Purchasing
8      Raphaely           30.0       Purchasing
9        Mavris           40.0  Human Resources
10        Grant           50.0         Shipping
11     OConnell           50.0         Shipping
12       Feeney           50.0         Shipping
13        Walsh           50.0         Shipping
14        Jones           50.0         Shipping
15       McCain           50.0         Shipping
16      Everett           50.0         Shipping
17         Bell           50.0         Shipping
18      Perkins           50.0         Shipping
19        Gates           50.0         Shipping
20        Dilly           50.0         Shipping
21        Chung           50.0         Shipping
22       Cabrio           50.0         Shipping
23    Dellinger           50.0         Shipping
24         Bull           50.0         Shipping
25     Sarchand           50.0         Shipping
26        Geoni           50.0         Shipping
27     Sullivan           50.0         Shipping
28       Fleaur           50.0         Shipping
29       Taylor           50.0         Shipping
..          ...            ...              ...
77      Vishney           80.0            Sales
78       Sewall           80.0            Sales
79        Doran           80.0            Sales
80        Smith           80.0            Sales
81       McEwen           80.0            Sales
82        Sully           80.0            Sales
83         King           80.0            Sales
84      Tuvault           80.0            Sales
85    Cambrault           80.0            Sales
86        Olsen           80.0            Sales
87         Hall           80.0            Sales
88    Bernstein           80.0            Sales
89       Tucker           80.0            Sales
90      Zlotkey           80.0            Sales
91    Cambrault           80.0            Sales
92    Errazuriz           80.0            Sales
93     Partners           80.0            Sales
94      Russell           80.0            Sales
95      De Haan           90.0        Executive
96      Kochhar           90.0        Executive
97         King           90.0        Executive
98         Popp          100.0          Finance
99        Urman          100.0          Finance
100     Sciarra          100.0          Finance
101        Chen          100.0          Finance
102      Faviet          100.0          Finance
103   Greenberg          100.0          Finance
104       Gietz          110.0       Accounting
105     Higgins          110.0       Accounting
106       Grant            NaN             None

[107 rows x 3 columns]

### < RIGHT OUTER JOIN >

In [14]:
df = pd.read_sql("""
        SELECT e.last_name, e.department_id, d.department_name
        FROM employees e,departments d
        WHERE e.department_id(+)= d.department_id
        """,xedb)
print(df)

      LAST_NAME  DEPARTMENT_ID       DEPARTMENT_NAME
0        Whalen           10.0        Administration
1           Fay           20.0             Marketing
2     Hartstein           20.0             Marketing
3        Tobias           30.0            Purchasing
4    Colmenares           30.0            Purchasing
5         Baida           30.0            Purchasing
6      Raphaely           30.0            Purchasing
7          Khoo           30.0            Purchasing
8        Himuro           30.0            Purchasing
9        Mavris           40.0       Human Resources
10       Feeney           50.0              Shipping
11       Fleaur           50.0              Shipping
12        Fripp           50.0              Shipping
13        Gates           50.0              Shipping
14          Gee           50.0              Shipping
15        Geoni           50.0              Shipping
16        Grant           50.0              Shipping
17        Jones           50.0              Shipping
18     Kaufling           50.0              Shipping
19       Ladwig           50.0              Shipping
20      Everett           50.0              Shipping
21        Dilly           50.0              Shipping
22    Dellinger           50.0              Shipping
23       Davies           50.0              Shipping
24        Chung           50.0              Shipping
25       Cabrio           50.0              Shipping
26         Bull           50.0              Shipping
27       Bissot           50.0              Shipping
28         Bell           50.0              Shipping
29     Atkinson           50.0              Shipping
..          ...            ...                   ...
92      Tuvault           80.0                 Sales
93      Vishney           80.0                 Sales
94      Zlotkey           80.0                 Sales
95      Kochhar           90.0             Executive
96         King           90.0             Executive
97      De Haan           90.0             Executive
98         Popp          100.0               Finance
99        Urman          100.0               Finance
100        Chen          100.0               Finance
101      Faviet          100.0               Finance
102     Sciarra          100.0               Finance
103   Greenberg          100.0               Finance
104       Gietz          110.0            Accounting
105     Higgins          110.0            Accounting
106        None            NaN              Treasury
107        None            NaN         Corporate Tax
108        None            NaN    Control And Credit
109        None            NaN  Shareholder Services
110        None            NaN              Benefits
111        None            NaN         Manufacturing
112        None            NaN          Construction
113        None            NaN           Contracting
114        None            NaN            Operations
115        None            NaN            IT Support
116        None            NaN                   NOC
117        None            NaN           IT Helpdesk
118        None            NaN      Government Sales
119        None            NaN          Retail Sales
120        None            NaN            Recruiting
121        None            NaN               Payroll

[122 rows x 3 columns]

In [15]:
df = pd.read_sql("""
        SELECT e.last_name, e.department_id, d.department_name
        FROM employees e
        RIGHT OUTER JOIN departments d
        ON (e.department_id = d.department_id)
        """,xedb)
print(df)

      LAST_NAME  DEPARTMENT_ID       DEPARTMENT_NAME
0        Whalen           10.0        Administration
1           Fay           20.0             Marketing
2     Hartstein           20.0             Marketing
3        Tobias           30.0            Purchasing
4    Colmenares           30.0            Purchasing
5         Baida           30.0            Purchasing
6      Raphaely           30.0            Purchasing
7          Khoo           30.0            Purchasing
8        Himuro           30.0            Purchasing
9        Mavris           40.0       Human Resources
10       Feeney           50.0              Shipping
11       Fleaur           50.0              Shipping
12        Fripp           50.0              Shipping
13        Gates           50.0              Shipping
14          Gee           50.0              Shipping
15        Geoni           50.0              Shipping
16        Grant           50.0              Shipping
17        Jones           50.0              Shipping
18     Kaufling           50.0              Shipping
19       Ladwig           50.0              Shipping
20      Everett           50.0              Shipping
21        Dilly           50.0              Shipping
22    Dellinger           50.0              Shipping
23       Davies           50.0              Shipping
24        Chung           50.0              Shipping
25       Cabrio           50.0              Shipping
26         Bull           50.0              Shipping
27       Bissot           50.0              Shipping
28         Bell           50.0              Shipping
29     Atkinson           50.0              Shipping
..          ...            ...                   ...
92      Tuvault           80.0                 Sales
93      Vishney           80.0                 Sales
94      Zlotkey           80.0                 Sales
95      Kochhar           90.0             Executive
96         King           90.0             Executive
97      De Haan           90.0             Executive
98         Popp          100.0               Finance
99        Urman          100.0               Finance
100        Chen          100.0               Finance
101      Faviet          100.0               Finance
102     Sciarra          100.0               Finance
103   Greenberg          100.0               Finance
104       Gietz          110.0            Accounting
105     Higgins          110.0            Accounting
106        None            NaN              Treasury
107        None            NaN         Corporate Tax
108        None            NaN    Control And Credit
109        None            NaN  Shareholder Services
110        None            NaN              Benefits
111        None            NaN         Manufacturing
112        None            NaN          Construction
113        None            NaN           Contracting
114        None            NaN            Operations
115        None            NaN            IT Support
116        None            NaN                   NOC
117        None            NaN           IT Helpdesk
118        None            NaN      Government Sales
119        None            NaN          Retail Sales
120        None            NaN            Recruiting
121        None            NaN               Payroll

[122 rows x 3 columns]

### < FULL OUTER JOIN >

In [16]:
df = pd.read_sql("""
        SELECT e.last_name, e.department_id, d.department_name
        FROM employees e, departments d
        WHERE e.department_id(+) = d.department_id(+)
        """,xedb)

ERROR:root:An unexpected error occurred while tokenizing input
The following traceback may be corrupted or invalid
The error message is: ('EOF in multi-line string', (1, 8))

DatabaseError: Execution failed on sql '
        SELECT e.last_name, e.department_id, d.department_name
        FROM employees e, departments d
        WHERE e.department_id(+) = d.department_id(+)
        ': ORA-01468: a predicate may reference only one outer-joined table

### FULL OUTER JOIN은  (+) 부호를 붙이면 오류가 난다
ORA-01468: a predicate may reference only one outer-joined table

In [17]:
df = pd.read_sql("""
        SELECT e.last_name, e.department_id, d.department_name
        FROM employees e
        FULL OUTER JOIN departments d\
        ON (e.department_id = d.department_id)
        """,xedb)
print(df)

       LAST_NAME  DEPARTMENT_ID       DEPARTMENT_NAME
0           King           90.0             Executive
1        Kochhar           90.0             Executive
2        De Haan           90.0             Executive
3         Hunold           60.0                    IT
4          Ernst           60.0                    IT
5         Austin           60.0                    IT
6      Pataballa           60.0                    IT
7        Lorentz           60.0                    IT
8      Greenberg          100.0               Finance
9         Faviet          100.0               Finance
10          Chen          100.0               Finance
11       Sciarra          100.0               Finance
12         Urman          100.0               Finance
13          Popp          100.0               Finance
14      Raphaely           30.0            Purchasing
15          Khoo           30.0            Purchasing
16         Baida           30.0            Purchasing
17        Tobias           30.0            Purchasing
18        Himuro           30.0            Purchasing
19    Colmenares           30.0            Purchasing
20         Weiss           50.0              Shipping
21         Fripp           50.0              Shipping
22      Kaufling           50.0              Shipping
23       Vollman           50.0              Shipping
24       Mourgos           50.0              Shipping
25         Nayer           50.0              Shipping
26   Mikkilineni           50.0              Shipping
27        Landry           50.0              Shipping
28        Markle           50.0              Shipping
29        Bissot           50.0              Shipping
..           ...            ...                   ...
93       Everett           50.0              Shipping
94        McCain           50.0              Shipping
95         Jones           50.0              Shipping
96         Walsh           50.0              Shipping
97        Feeney           50.0              Shipping
98      OConnell           50.0              Shipping
99         Grant           50.0              Shipping
100       Whalen           10.0        Administration
101    Hartstein           20.0             Marketing
102          Fay           20.0             Marketing
103       Mavris           40.0       Human Resources
104         Baer           70.0      Public Relations
105      Higgins          110.0            Accounting
106        Gietz          110.0            Accounting
107         None            NaN                   NOC
108         None            NaN         Manufacturing
109         None            NaN      Government Sales
110         None            NaN            IT Support
111         None            NaN              Benefits
112         None            NaN  Shareholder Services
113         None            NaN          Retail Sales
114         None            NaN    Control And Credit
115         None            NaN            Recruiting
116         None            NaN            Operations
117         None            NaN              Treasury
118         None            NaN               Payroll
119         None            NaN         Corporate Tax
120         None            NaN          Construction
121         None            NaN           Contracting
122         None            NaN           IT Helpdesk

[123 rows x 3 columns]

## 4-4 SELF JOIN
* 자신의 테이블을 참조해야 할 때 사용

#### 사원의 employee_id, last_name, 해당 관리자의 employee_id, last_name 조회

In [18]:
df = pd.read_sql("""
        SELECT employee_id, last_name, manager_id
        FROM employees
        """,xedb)
print(df)

     EMPLOYEE_ID    LAST_NAME  MANAGER_ID
0            100         King         NaN
1            101      Kochhar       100.0
2            102      De Haan       100.0
3            103       Hunold       102.0
4            104        Ernst       103.0
5            105       Austin       103.0
6            106    Pataballa       103.0
7            107      Lorentz       103.0
8            108    Greenberg       101.0
9            109       Faviet       108.0
10           110         Chen       108.0
11           111      Sciarra       108.0
12           112        Urman       108.0
13           113         Popp       108.0
14           114     Raphaely       100.0
15           115         Khoo       114.0
16           116        Baida       114.0
17           117       Tobias       114.0
18           118       Himuro       114.0
19           119   Colmenares       114.0
20           120        Weiss       100.0
21           121        Fripp       100.0
22           122     Kaufling       100.0
23           123      Vollman       100.0
24           124      Mourgos       100.0
25           125        Nayer       120.0
26           126  Mikkilineni       120.0
27           127       Landry       120.0
28           128       Markle       120.0
29           129       Bissot       121.0
..           ...          ...         ...
77           177   Livingston       149.0
78           178        Grant       149.0
79           179      Johnson       149.0
80           180       Taylor       120.0
81           181       Fleaur       120.0
82           182     Sullivan       120.0
83           183        Geoni       120.0
84           184     Sarchand       121.0
85           185         Bull       121.0
86           186    Dellinger       121.0
87           187       Cabrio       121.0
88           188        Chung       122.0
89           189        Dilly       122.0
90           190        Gates       122.0
91           191      Perkins       122.0
92           192         Bell       123.0
93           193      Everett       123.0
94           194       McCain       123.0
95           195        Jones       123.0
96           196        Walsh       124.0
97           197       Feeney       124.0
98           198     OConnell       124.0
99           199        Grant       124.0
100          200       Whalen       101.0
101          201    Hartstein       100.0
102          202          Fay       201.0
103          203       Mavris       101.0
104          204         Baer       101.0
105          205      Higgins       101.0
106          206        Gietz       205.0

[107 rows x 3 columns]

In [23]:
# WHERE m.employee_id = w.manager_id

df = pd.read_sql("""
        SELECT w.employee_id, w.last_name, m.employee_id, m.last_name
        FROM employees w, employees m
        WHERE m.employee_id = w.manager_id
        ORDER BY w.employee_id
        """,xedb)
print(df)

     EMPLOYEE_ID    LAST_NAME  EMPLOYEE_ID  LAST_NAME
0            101      Kochhar          100       King
1            102      De Haan          100       King
2            103       Hunold          102    De Haan
3            104        Ernst          103     Hunold
4            105       Austin          103     Hunold
5            106    Pataballa          103     Hunold
6            107      Lorentz          103     Hunold
7            108    Greenberg          101    Kochhar
8            109       Faviet          108  Greenberg
9            110         Chen          108  Greenberg
10           111      Sciarra          108  Greenberg
11           112        Urman          108  Greenberg
12           113         Popp          108  Greenberg
13           114     Raphaely          100       King
14           115         Khoo          114   Raphaely
15           116        Baida          114   Raphaely
16           117       Tobias          114   Raphaely
17           118       Himuro          114   Raphaely
18           119   Colmenares          114   Raphaely
19           120        Weiss          100       King
20           121        Fripp          100       King
21           122     Kaufling          100       King
22           123      Vollman          100       King
23           124      Mourgos          100       King
24           125        Nayer          120      Weiss
25           126  Mikkilineni          120      Weiss
26           127       Landry          120      Weiss
27           128       Markle          120      Weiss
28           129       Bissot          121      Fripp
29           130     Atkinson          121      Fripp
..           ...          ...          ...        ...
76           177   Livingston          149    Zlotkey
77           178        Grant          149    Zlotkey
78           179      Johnson          149    Zlotkey
79           180       Taylor          120      Weiss
80           181       Fleaur          120      Weiss
81           182     Sullivan          120      Weiss
82           183        Geoni          120      Weiss
83           184     Sarchand          121      Fripp
84           185         Bull          121      Fripp
85           186    Dellinger          121      Fripp
86           187       Cabrio          121      Fripp
87           188        Chung          122   Kaufling
88           189        Dilly          122   Kaufling
89           190        Gates          122   Kaufling
90           191      Perkins          122   Kaufling
91           192         Bell          123    Vollman
92           193      Everett          123    Vollman
93           194       McCain          123    Vollman
94           195        Jones          123    Vollman
95           196        Walsh          124    Mourgos
96           197       Feeney          124    Mourgos
97           198     OConnell          124    Mourgos
98           199        Grant          124    Mourgos
99           200       Whalen          101    Kochhar
100          201    Hartstein          100       King
101          202          Fay          201  Hartstein
102          203       Mavris          101    Kochhar
103          204         Baer          101    Kochhar
104          205      Higgins          101    Kochhar
105          206        Gietz          205    Higgins

[106 rows x 4 columns]

In [26]:
# WHERE w.employee_id= m.manager_id

df = pd.read_sql("""
        SELECT w.employee_id, w.last_name, m.employee_id, m.last_name
        FROM employees w, employees m
        WHERE w.employee_id= m.manager_id
        ORDER BY w.employee_id
        """,xedb)
print(df)

     EMPLOYEE_ID  LAST_NAME  EMPLOYEE_ID   LAST_NAME
0            100       King          101     Kochhar
1            100       King          102     De Haan
2            100       King          114    Raphaely
3            100       King          120       Weiss
4            100       King          121       Fripp
5            100       King          122    Kaufling
6            100       King          123     Vollman
7            100       King          124     Mourgos
8            100       King          145     Russell
9            100       King          146    Partners
10           100       King          147   Errazuriz
11           100       King          148   Cambrault
12           100       King          149     Zlotkey
13           100       King          201   Hartstein
14           101    Kochhar          108   Greenberg
15           101    Kochhar          200      Whalen
16           101    Kochhar          203      Mavris
17           101    Kochhar          204        Baer
18           101    Kochhar          205     Higgins
19           102    De Haan          103      Hunold
20           103     Hunold          104       Ernst
21           103     Hunold          105      Austin
22           103     Hunold          106   Pataballa
23           103     Hunold          107     Lorentz
24           108  Greenberg          109      Faviet
25           108  Greenberg          110        Chen
26           108  Greenberg          111     Sciarra
27           108  Greenberg          112       Urman
28           108  Greenberg          113        Popp
29           114   Raphaely          115        Khoo
..           ...        ...          ...         ...
76           145    Russell          152        Hall
77           145    Russell          153       Olsen
78           145    Russell          154   Cambrault
79           145    Russell          155     Tuvault
80           146   Partners          156        King
81           146   Partners          157       Sully
82           146   Partners          158      McEwen
83           146   Partners          159       Smith
84           146   Partners          160       Doran
85           146   Partners          161      Sewall
86           147  Errazuriz          162     Vishney
87           147  Errazuriz          163      Greene
88           147  Errazuriz          164     Marvins
89           147  Errazuriz          165         Lee
90           147  Errazuriz          166        Ande
91           147  Errazuriz          167       Banda
92           148  Cambrault          168        Ozer
93           148  Cambrault          173       Kumar
94           148  Cambrault          172       Bates
95           148  Cambrault          171       Smith
96           148  Cambrault          170         Fox
97           148  Cambrault          169       Bloom
98           149    Zlotkey          174        Abel
99           149    Zlotkey          175      Hutton
100          149    Zlotkey          179     Johnson
101          149    Zlotkey          178       Grant
102          149    Zlotkey          177  Livingston
103          149    Zlotkey          176      Taylor
104          201  Hartstein          202         Fay
105          205    Higgins          206       Gietz

[106 rows x 4 columns]

In [25]:
df = pd.read_sql("""
                 SELECT w.employee_id, w.last_name, m.employee_id, m.last_name
                 FROM employees w, employees m
                 WHERE w.manager_id = m.employee_id(+)
                 ORDER BY w.employee_id
                 """,xedb)
print(df)

     EMPLOYEE_ID    LAST_NAME  EMPLOYEE_ID  LAST_NAME
0            100         King          NaN       None
1            101      Kochhar        100.0       King
2            102      De Haan        100.0       King
3            103       Hunold        102.0    De Haan
4            104        Ernst        103.0     Hunold
5            105       Austin        103.0     Hunold
6            106    Pataballa        103.0     Hunold
7            107      Lorentz        103.0     Hunold
8            108    Greenberg        101.0    Kochhar
9            109       Faviet        108.0  Greenberg
10           110         Chen        108.0  Greenberg
11           111      Sciarra        108.0  Greenberg
12           112        Urman        108.0  Greenberg
13           113         Popp        108.0  Greenberg
14           114     Raphaely        100.0       King
15           115         Khoo        114.0   Raphaely
16           116        Baida        114.0   Raphaely
17           117       Tobias        114.0   Raphaely
18           118       Himuro        114.0   Raphaely
19           119   Colmenares        114.0   Raphaely
20           120        Weiss        100.0       King
21           121        Fripp        100.0       King
22           122     Kaufling        100.0       King
23           123      Vollman        100.0       King
24           124      Mourgos        100.0       King
25           125        Nayer        120.0      Weiss
26           126  Mikkilineni        120.0      Weiss
27           127       Landry        120.0      Weiss
28           128       Markle        120.0      Weiss
29           129       Bissot        121.0      Fripp
..           ...          ...          ...        ...
77           177   Livingston        149.0    Zlotkey
78           178        Grant        149.0    Zlotkey
79           179      Johnson        149.0    Zlotkey
80           180       Taylor        120.0      Weiss
81           181       Fleaur        120.0      Weiss
82           182     Sullivan        120.0      Weiss
83           183        Geoni        120.0      Weiss
84           184     Sarchand        121.0      Fripp
85           185         Bull        121.0      Fripp
86           186    Dellinger        121.0      Fripp
87           187       Cabrio        121.0      Fripp
88           188        Chung        122.0   Kaufling
89           189        Dilly        122.0   Kaufling
90           190        Gates        122.0   Kaufling
91           191      Perkins        122.0   Kaufling
92           192         Bell        123.0    Vollman
93           193      Everett        123.0    Vollman
94           194       McCain        123.0    Vollman
95           195        Jones        123.0    Vollman
96           196        Walsh        124.0    Mourgos
97           197       Feeney        124.0    Mourgos
98           198     OConnell        124.0    Mourgos
99           199        Grant        124.0    Mourgos
100          200       Whalen        101.0    Kochhar
101          201    Hartstein        100.0       King
102          202          Fay        201.0  Hartstein
103          203       Mavris        101.0    Kochhar
104          204         Baer        101.0    Kochhar
105          205      Higgins        101.0    Kochhar
106          206        Gietz        205.0    Higgins

[107 rows x 4 columns]

## 4-5 JOIN USING

In [27]:
df = pd.read_sql("""
        SELECT l.city, d.department_name
        FROM locations l
        JOIN departments d 
        USING (location_id)
        WHERE location_id = 1400
        """,xedb)
print(df)

        CITY DEPARTMENT_NAME
0  Southlake              IT

In [28]:
df = pd.read_sql("""
        SELECT city, department_name
        FROM locations 
        JOIN departments 
        USING (location_id)
        WHERE location_id = 1400
        """,xedb)
print(df)

        CITY DEPARTMENT_NAME
0  Southlake              IT

***
# 더 연습문제 
***

#### (1) 모든 사원의 last_name, department_id, department_name을 조회하세요.

In [29]:
df = pd.read_sql("""
        SELECT e.last_name, e.department_id, d.department_name
        FROM employees e, departments d
        WHERE e.department_id = d.department_id
        """,xedb)
print(df)

#부서배치가 안 된 사원은 누락되어 조회된다

      LAST_NAME  DEPARTMENT_ID  DEPARTMENT_NAME
0        Whalen             10   Administration
1           Fay             20        Marketing
2     Hartstein             20        Marketing
3        Tobias             30       Purchasing
4    Colmenares             30       Purchasing
5         Baida             30       Purchasing
6      Raphaely             30       Purchasing
7          Khoo             30       Purchasing
8        Himuro             30       Purchasing
9        Mavris             40  Human Resources
10       Feeney             50         Shipping
11       Fleaur             50         Shipping
12        Fripp             50         Shipping
13        Gates             50         Shipping
14          Gee             50         Shipping
15        Geoni             50         Shipping
16        Grant             50         Shipping
17        Jones             50         Shipping
18     Kaufling             50         Shipping
19       Ladwig             50         Shipping
20      Everett             50         Shipping
21        Dilly             50         Shipping
22    Dellinger             50         Shipping
23       Davies             50         Shipping
24        Chung             50         Shipping
25       Cabrio             50         Shipping
26         Bull             50         Shipping
27       Bissot             50         Shipping
28         Bell             50         Shipping
29     Atkinson             50         Shipping
..          ...            ...              ...
76         King             80            Sales
77        Kumar             80            Sales
78          Lee             80            Sales
79   Livingston             80            Sales
80      Marvins             80            Sales
81       McEwen             80            Sales
82        Olsen             80            Sales
83         Ozer             80            Sales
84     Partners             80            Sales
85      Russell             80            Sales
86       Sewall             80            Sales
87        Smith             80            Sales
88        Smith             80            Sales
89        Sully             80            Sales
90       Taylor             80            Sales
91       Tucker             80            Sales
92      Tuvault             80            Sales
93      Vishney             80            Sales
94      Zlotkey             80            Sales
95      Kochhar             90        Executive
96         King             90        Executive
97      De Haan             90        Executive
98         Popp            100          Finance
99        Urman            100          Finance
100        Chen            100          Finance
101      Faviet            100          Finance
102     Sciarra            100          Finance
103   Greenberg            100          Finance
104       Gietz            110       Accounting
105     Higgins            110       Accounting

[106 rows x 3 columns]

#### (2) 부서배치가 안 된 사원을 포함하여 모든 사원의 last_name, department_id, department_name을 조회하세요.

In [30]:
df = pd.read_sql("""
        SELECT e.last_name, e.department_id, d.department_name
        FROM employees e, departments d
        WHERE e.department_id = d.department_id(+)
        """,xedb)
print(df)

      LAST_NAME  DEPARTMENT_ID  DEPARTMENT_NAME
0        Whalen           10.0   Administration
1           Fay           20.0        Marketing
2     Hartstein           20.0        Marketing
3    Colmenares           30.0       Purchasing
4        Himuro           30.0       Purchasing
5        Tobias           30.0       Purchasing
6         Baida           30.0       Purchasing
7          Khoo           30.0       Purchasing
8      Raphaely           30.0       Purchasing
9        Mavris           40.0  Human Resources
10        Grant           50.0         Shipping
11     OConnell           50.0         Shipping
12       Feeney           50.0         Shipping
13        Walsh           50.0         Shipping
14        Jones           50.0         Shipping
15       McCain           50.0         Shipping
16      Everett           50.0         Shipping
17         Bell           50.0         Shipping
18      Perkins           50.0         Shipping
19        Gates           50.0         Shipping
20        Dilly           50.0         Shipping
21        Chung           50.0         Shipping
22       Cabrio           50.0         Shipping
23    Dellinger           50.0         Shipping
24         Bull           50.0         Shipping
25     Sarchand           50.0         Shipping
26        Geoni           50.0         Shipping
27     Sullivan           50.0         Shipping
28       Fleaur           50.0         Shipping
29       Taylor           50.0         Shipping
..          ...            ...              ...
77      Vishney           80.0            Sales
78       Sewall           80.0            Sales
79        Doran           80.0            Sales
80        Smith           80.0            Sales
81       McEwen           80.0            Sales
82        Sully           80.0            Sales
83         King           80.0            Sales
84      Tuvault           80.0            Sales
85    Cambrault           80.0            Sales
86        Olsen           80.0            Sales
87         Hall           80.0            Sales
88    Bernstein           80.0            Sales
89       Tucker           80.0            Sales
90      Zlotkey           80.0            Sales
91    Cambrault           80.0            Sales
92    Errazuriz           80.0            Sales
93     Partners           80.0            Sales
94      Russell           80.0            Sales
95      De Haan           90.0        Executive
96      Kochhar           90.0        Executive
97         King           90.0        Executive
98         Popp          100.0          Finance
99        Urman          100.0          Finance
100     Sciarra          100.0          Finance
101        Chen          100.0          Finance
102      Faviet          100.0          Finance
103   Greenberg          100.0          Finance
104       Gietz          110.0       Accounting
105     Higgins          110.0       Accounting
106       Grant            NaN             None

[107 rows x 3 columns]

#### (3) 부서 80에 속하는 사원의 last_name, job_id, department_name, location_id을 조회하세요.

In [31]:
df = pd.read_sql("""
        SELECT  e.last_name, e.job_id, d.department_name,d.location_id
        FROM employees e, departments d
        WHERE e.department_id = d.department_id
        AND d.department_id = 80
        """,xedb)
print(df)

     LAST_NAME  JOB_ID DEPARTMENT_NAME  LOCATION_ID
0      Russell  SA_MAN           Sales         2500
1     Partners  SA_MAN           Sales         2500
2    Errazuriz  SA_MAN           Sales         2500
3    Cambrault  SA_MAN           Sales         2500
4      Zlotkey  SA_MAN           Sales         2500
5       Tucker  SA_REP           Sales         2500
6    Bernstein  SA_REP           Sales         2500
7         Hall  SA_REP           Sales         2500
8        Olsen  SA_REP           Sales         2500
9    Cambrault  SA_REP           Sales         2500
10     Tuvault  SA_REP           Sales         2500
11        King  SA_REP           Sales         2500
12       Sully  SA_REP           Sales         2500
13      McEwen  SA_REP           Sales         2500
14       Smith  SA_REP           Sales         2500
15       Doran  SA_REP           Sales         2500
16      Sewall  SA_REP           Sales         2500
17     Vishney  SA_REP           Sales         2500
18      Greene  SA_REP           Sales         2500
19     Marvins  SA_REP           Sales         2500
20         Lee  SA_REP           Sales         2500
21        Ande  SA_REP           Sales         2500
22       Banda  SA_REP           Sales         2500
23        Ozer  SA_REP           Sales         2500
24       Bloom  SA_REP           Sales         2500
25         Fox  SA_REP           Sales         2500
26       Smith  SA_REP           Sales         2500
27       Bates  SA_REP           Sales         2500
28       Kumar  SA_REP           Sales         2500
29        Abel  SA_REP           Sales         2500
30      Hutton  SA_REP           Sales         2500
31      Taylor  SA_REP           Sales         2500
32  Livingston  SA_REP           Sales         2500
33     Johnson  SA_REP           Sales         2500

In [32]:
df = pd.read_sql("""
        SELECT  e.last_name,e.job_id, d.department_name,d.location_id
        FROM employees e, departments d
        WHERE e.department_id = 80
        AND d.department_id = 80
        """,xedb)
print(df)

     LAST_NAME  JOB_ID DEPARTMENT_NAME  LOCATION_ID
0      Russell  SA_MAN           Sales         2500
1     Partners  SA_MAN           Sales         2500
2    Errazuriz  SA_MAN           Sales         2500
3    Cambrault  SA_MAN           Sales         2500
4      Zlotkey  SA_MAN           Sales         2500
5       Tucker  SA_REP           Sales         2500
6    Bernstein  SA_REP           Sales         2500
7         Hall  SA_REP           Sales         2500
8        Olsen  SA_REP           Sales         2500
9    Cambrault  SA_REP           Sales         2500
10     Tuvault  SA_REP           Sales         2500
11        King  SA_REP           Sales         2500
12       Sully  SA_REP           Sales         2500
13      McEwen  SA_REP           Sales         2500
14       Smith  SA_REP           Sales         2500
15       Doran  SA_REP           Sales         2500
16      Sewall  SA_REP           Sales         2500
17     Vishney  SA_REP           Sales         2500
18      Greene  SA_REP           Sales         2500
19     Marvins  SA_REP           Sales         2500
20         Lee  SA_REP           Sales         2500
21        Ande  SA_REP           Sales         2500
22       Banda  SA_REP           Sales         2500
23        Ozer  SA_REP           Sales         2500
24       Bloom  SA_REP           Sales         2500
25         Fox  SA_REP           Sales         2500
26       Smith  SA_REP           Sales         2500
27       Bates  SA_REP           Sales         2500
28       Kumar  SA_REP           Sales         2500
29        Abel  SA_REP           Sales         2500
30      Hutton  SA_REP           Sales         2500
31      Taylor  SA_REP           Sales         2500
32  Livingston  SA_REP           Sales         2500
33     Johnson  SA_REP           Sales         2500

#### (4) commission을 지급받는 사원들의last_name, department_name, location_id, city를 조회하세요

In [33]:
df = pd.read_sql("""
        SELECT e.last_name, d.department_name, d.location_id, l.city
        FROM employees e, departments d, locations l
        WHERE e.department_id = d.department_id(+)
        AND  d.location_id = l.location_id(+)
        AND e.commission_pct IS NOT NULL
        """,xedb)
print(df)

     LAST_NAME DEPARTMENT_NAME  LOCATION_ID    CITY
0      Russell           Sales       2500.0  Oxford
1     Partners           Sales       2500.0  Oxford
2    Errazuriz           Sales       2500.0  Oxford
3    Cambrault           Sales       2500.0  Oxford
4      Zlotkey           Sales       2500.0  Oxford
5       Tucker           Sales       2500.0  Oxford
6    Bernstein           Sales       2500.0  Oxford
7         Hall           Sales       2500.0  Oxford
8        Olsen           Sales       2500.0  Oxford
9    Cambrault           Sales       2500.0  Oxford
10     Tuvault           Sales       2500.0  Oxford
11        King           Sales       2500.0  Oxford
12       Sully           Sales       2500.0  Oxford
13      McEwen           Sales       2500.0  Oxford
14       Smith           Sales       2500.0  Oxford
15       Doran           Sales       2500.0  Oxford
16      Sewall           Sales       2500.0  Oxford
17     Vishney           Sales       2500.0  Oxford
18      Greene           Sales       2500.0  Oxford
19     Marvins           Sales       2500.0  Oxford
20         Lee           Sales       2500.0  Oxford
21        Ande           Sales       2500.0  Oxford
22       Banda           Sales       2500.0  Oxford
23        Ozer           Sales       2500.0  Oxford
24       Bloom           Sales       2500.0  Oxford
25         Fox           Sales       2500.0  Oxford
26       Smith           Sales       2500.0  Oxford
27       Bates           Sales       2500.0  Oxford
28       Kumar           Sales       2500.0  Oxford
29        Abel           Sales       2500.0  Oxford
30      Hutton           Sales       2500.0  Oxford
31      Taylor           Sales       2500.0  Oxford
32  Livingston           Sales       2500.0  Oxford
33     Johnson           Sales       2500.0  Oxford
34       Grant            None          NaN    None

#### (5) last_name에 'a'가 포함된 모든 사원의 last_name, department_name을 조회하세요.

In [34]:
df = pd.read_sql("""
        SELECT e.last_name, d.department_name
        FROM employees e, departments d
        WHERE e.department_id = d.department_id(+)
        AND instr(e.last_name,'a') > 0
        """,xedb)
print(df)

     LAST_NAME   DEPARTMENT_NAME
0       Whalen    Administration
1          Fay         Marketing
2    Hartstein         Marketing
3   Colmenares        Purchasing
4       Tobias        Purchasing
5        Baida        Purchasing
6     Raphaely        Purchasing
7       Mavris   Human Resources
8        Grant          Shipping
9        Walsh          Shipping
10      McCain          Shipping
11       Gates          Shipping
12      Cabrio          Shipping
13    Sarchand          Shipping
14    Sullivan          Shipping
15      Fleaur          Shipping
16      Taylor          Shipping
17      Vargas          Shipping
18       Matos          Shipping
19      Davies          Shipping
20        Rajs          Shipping
21       Patel          Shipping
22      Ladwig          Shipping
23  Philtanker          Shipping
24      Mallin          Shipping
25      Marlow          Shipping
26      Markle          Shipping
27      Landry          Shipping
28       Nayer          Shipping
29     Vollman          Shipping
30    Kaufling          Shipping
31   Pataballa                IT
32        Baer  Public Relations
33      Taylor             Sales
34       Kumar             Sales
35       Bates             Sales
36       Banda             Sales
37     Marvins             Sales
38      Sewall             Sales
39       Doran             Sales
40     Tuvault             Sales
41   Cambrault             Sales
42        Hall             Sales
43   Cambrault             Sales
44   Errazuriz             Sales
45    Partners             Sales
46     De Haan         Executive
47     Kochhar         Executive
48       Urman           Finance
49     Sciarra           Finance
50      Faviet           Finance
51       Grant              None

In [35]:
df = pd.read_sql("""
        SELECT e.last_name, d.department_name
        FROM employees e 
        LEFT OUTER JOIN departments d
        ON e.department_id = d.department_id
        WHERE e.last_name LIKE '%a%'
        """,xedb)
print(df)

     LAST_NAME   DEPARTMENT_NAME
0       Whalen    Administration
1          Fay         Marketing
2    Hartstein         Marketing
3   Colmenares        Purchasing
4       Tobias        Purchasing
5        Baida        Purchasing
6     Raphaely        Purchasing
7       Mavris   Human Resources
8        Grant          Shipping
9        Walsh          Shipping
10      McCain          Shipping
11       Gates          Shipping
12      Cabrio          Shipping
13    Sarchand          Shipping
14    Sullivan          Shipping
15      Fleaur          Shipping
16      Taylor          Shipping
17      Vargas          Shipping
18       Matos          Shipping
19      Davies          Shipping
20        Rajs          Shipping
21       Patel          Shipping
22      Ladwig          Shipping
23  Philtanker          Shipping
24      Mallin          Shipping
25      Marlow          Shipping
26      Markle          Shipping
27      Landry          Shipping
28       Nayer          Shipping
29     Vollman          Shipping
30    Kaufling          Shipping
31   Pataballa                IT
32        Baer  Public Relations
33      Taylor             Sales
34       Kumar             Sales
35       Bates             Sales
36       Banda             Sales
37     Marvins             Sales
38      Sewall             Sales
39       Doran             Sales
40     Tuvault             Sales
41   Cambrault             Sales
42        Hall             Sales
43   Cambrault             Sales
44   Errazuriz             Sales
45    Partners             Sales
46     De Haan         Executive
47     Kochhar         Executive
48       Urman           Finance
49     Sciarra           Finance
50      Faviet           Finance
51       Grant              None

#### (6) toronto도시(location테이블, city컬럼)에서 근무하는 모든 사원의 last_name, job_id, department_id, department_name을 조회하세요.

In [37]:
df = pd.read_sql("""
        SELECT e.last_name, e.job_id, e.department_id,d.department_name
        FROM employees e, departments d, locations l
        WHERE e.department_id = d.department_id
        AND d.location_id = l.location_id
        AND l.city = 'Toronto'
        """,xedb)
print(df)

   LAST_NAME  JOB_ID  DEPARTMENT_ID DEPARTMENT_NAME
0  Hartstein  MK_MAN             20       Marketing
1        Fay  MK_REP             20       Marketing

#### (7) 2006년도에 입사한 사원들의 부서이름별 급여총액과 평균급여를 출력하세요.

In [38]:
df = pd.read_sql("""
        SELECT d.department_name, sum(e.salary) sumsal, round(avg(e.salary),0) avgsal
        FROM employees e, departments d
        WHERE e.department_id = d.department_id
        AND e.hire_date >= to_date('2006-01-01','YYYY-MM-DD')
        AND e.hire_date < to_date('2007-01-01','YYYY-MM-DD')
        GROUP BY d.department_name
        """,xedb)
print(df)

  DEPARTMENT_NAME  SUMSAL  AVGSAL
0      Purchasing    2600    2600
1              IT   13800    6900
2        Shipping   37800    2908
3           Sales   59100    8443
4         Finance    7800    7800

#### (8) 2006년도에 입사한 사원들의 도시이름별 급여총액과 평균급여를 출력하세요.

In [39]:
df = pd.read_sql("""
        SELECT l.city, sum(e.salary) sumsal, round(avg(e.salary),0) avgsal
        FROM employees e, departments d, locations l
        WHERE e.department_id = d.department_id
        AND d.location_id = l.location_id
        AND e.hire_date >= to_date('2006-01-01','YYYY-MM-DD')
        AND e.hire_date < to_date('2007-01-01','YYYY-MM-DD')
        GROUP BY l.city
        """,xedb)
print(df)

                  CITY  SUMSAL  AVGSAL
0              Seattle   10400    5200
1  South San Francisco   37800    2908
2            Southlake   13800    6900
3               Oxford   59100    8443

#### (9) 2007년도에 입사한 사원들의 도시이름별로 급여총액과 평균급여를 출력하세요.(부서 배치를 받지 않는 사원을 포함)

In [40]:
df = pd.read_sql("""
        SELECT l.city, sum(e.salary) sumsal, round(avg(e.salary),0) avgsal
        FROM employees e, departments d, locations l
        WHERE e.department_id = d.department_id(+)
        AND d.location_id = l.location_id(+)
        AND e.hire_date >= to_date('2007-01-01','YYYY-MM-DD')
        AND e.hire_date < to_date('2008-01-01','YYYY-MM-DD')
        GROUP BY l.city
        """,xedb)
print(df)

                  CITY  SUMSAL  AVGSAL
0                 None    7000    7000
1              Seattle    9400    4700
2  South San Francisco   26100    2900
3            Southlake   10200    5100
4               Oxford   42200    8440

In [ ]:
cur.close()
xedb.close()